In [1]:
import os
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from datetime import date, timedelta
from pandas.tseries.offsets import * 
import calendar

pd.options.display.max_rows = 30
float_formatter = "à¸¿{:,.2f}"

engine = create_engine("mysql+pymysql://root:@localhost:3306/stock")
const = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
one_path = "\\Users\\User\\OneDrive\\Documents\\Data\\"
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"

today = date.today()
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 7, 7), datetime.date(2023, 7, 6))

In [2]:
#today = date(2023, 4, 25)
yesterday = today - timedelta(days=1)
today, yesterday

(datetime.date(2023, 7, 7), datetime.date(2023, 7, 6))

In [3]:
# convert the timedelta object to a BusinessDay object
num_business_days = BDay(2)
yesterday = today - num_business_days
print(f'today: {today}')
to_mmdd = today.strftime('%m-%d')
print(f'Today in mm-dd format: {to_mmdd}')
print(f'yesterday: {yesterday}')

today: 2023-07-07
Today in mm-dd format: 07-07
yesterday: 2023-07-05 00:00:00

In [4]:
#yesterday = yesterday.date()
yesterday

Timestamp('2023-07-05 00:00:00')

In [5]:
sql = '''
SELECT period, name, volbuy AS shares
FROM buy
ORDER BY period, name'''
buy = pd.read_sql(sql, const)
buy['shares'] = buy['shares'].astype('int64')
buy

   period     name  shares
0       1    JASIF  130000
1       1      MCS   78000
2       1    PTTGC    6000
3       1      TMT   36000
4       2      ASK    4500
5       2      ASP   30000
6       2  CPNREIT   60000
7       2      DIF   30000
8       2   GVREIT   30000
9       2      NER   27000
10      2      ORI   45000
11      2      RCL   27000
12      2     SENA  105000
13      2      STA    5000
14      2    TFFIF   10000
15      2    WHAIR   50000
16      2    WHART   30000
17      3      BBL     400
18      3      IVL    7200
19      3      JMT    6000
20      3      SCC     600
21      4       AH    1200
22      4      AWC    9000
23      4      BCH   15000
24      4     ICHI    1500
25      4    JMART   10800
26      4      KCE   10000
27      4      KTC     900
28      4   SINGER    6000
29      4    SYNEX   15000

In [6]:
file_name = "buy-input.csv"
data_file = data_path + file_name
osd_file = osd_path + file_name
buy.to_csv(data_file, index=False)
buy.to_csv(osd_file, index=False)

In [7]:
sql = """
SELECT *
FROM price
LIMIT 1"""
prices = pd.read_sql(sql, const)
prices.dtypes

name      object
date      object
price    float64
maxp     float64
minp     float64
qty        int64
opnp     float64
dtype: object

### Call ruby ruby\find-change-fm-2-dates.rb

In [8]:
%pwd

'C:\\Users\\User\\OneDrive\\A7\\Daily'

In [9]:
os.chdir("C:\\users\\user\\onedrive\\a7")
%pwd

'C:\\users\\user\\onedrive\\a7'

In [10]:
!ruby ruby\\find-change-fm-2-dates.rb '2022-12-30' '2023-07-07'

    period       name     shares      date1      date2     price1     price2     change    %change     amount        spd
         1      JASIF     130000   22-12-30   23-07-07       8.05       7.05      -1.00     -12.42 -130,000.00        -20
         1        MCS      78000   22-12-30   23-07-07       8.95       6.45      -2.50     -27.93 -195,000.00        -50
         1      PTTGC       6000   22-12-30   23-07-07      47.25      38.50      -8.75     -18.52 -52,500.00        -35
         1        TMT      36000   22-12-30   23-07-07       7.80       7.40      -0.40      -5.13 -14,400.00         -8
         2        ASK       4500   22-12-30   23-07-07      35.50      25.00     -10.50     -29.58 -47,250.00        -42
         2        ASP      30000   22-12-30   23-07-07       2.98       2.80      -0.18      -6.04  -5,400.00         -9
         2    CPNREIT      60000   22-12-30   23-07-07      19.50      11.00      -8.50     -43.59 -510,000.00        -85
         2        DIF      30000   22-12-30   23-07-07      13.20      10.90      -2.30     -17.42 -69,000.00        -23
         2     GVREIT      30000   22-12-30   23-07-07       9.10       8.25      -0.85      -9.34 -25,500.00        -17
         2        NER      27000   22-12-30   23-07-07       6.35       4.50      -1.85     -29.13 -49,950.00        -52
         2        ORI      45000   22-12-30   23-07-07      12.10      10.10      -2.00     -16.53 -90,000.00        -20
         2        RCL      27000   22-12-30   23-07-07      30.75      24.00      -6.75     -21.95 -182,250.00        -33
         2       SENA     105000   22-12-30   23-07-07       3.94       2.98      -0.96     -24.37 -100,800.00        -48
         2        STA       5000   22-12-30   23-07-07      21.10      17.20      -3.90     -18.48 -19,500.00        -39
         2      TFFIF      10000   22-12-30   23-07-07       7.65       7.60      -0.05      -0.65    -500.00         -1
         2      WHAIR      50000   22-12-30   23-07-07       7.45       7.05      -0.40      -5.37 -20,000.00         -8
         2      WHART      30000   22-12-30   23-07-07      10.70      10.50      -0.20      -1.87  -6,000.00         -2
         3        BBL        400   22-12-30   23-07-07     148.00     156.00       8.00       5.41   3,200.00         16
         3        IVL       7200   22-12-30   23-07-07      40.75      33.25      -7.50     -18.40 -54,000.00        -30
         3        JMT       6000   22-12-30   23-07-07      69.00      36.25     -32.75     -47.46 -196,500.00       -131
         3        SCC        600   22-12-30   23-07-07     342.00     322.00     -20.00      -5.85 -12,000.00        -20
         4         AH       1200   22-12-30   23-07-07      29.75      35.75       6.00      20.17   7,200.00         24
         4        AWC       9000   22-12-30   23-07-07       6.30       4.60      -1.70     -26.98 -15,300.00        -46
         4        BCH      15000   22-12-30   23-07-07      20.50      17.40      -3.10     -15.12 -46,500.00        -31
         4       ICHI       1500   22-12-30   23-07-07      11.30      13.60       2.30      20.35   3,450.00         23
         4      JMART      10800   22-12-30   23-07-07      40.75      16.30     -24.45     -60.00 -264,060.00       -150
         4        KCE      10000   22-12-30   23-07-07      46.50      36.50     -10.00     -21.51 -100,000.00        -40
         4        KTC        900   22-12-30   23-07-07      59.00      46.00     -13.00     -22.03 -11,700.00        -52
         4     SINGER       6000   22-12-30   23-07-07      28.75       9.15     -19.60     -68.17 -117,600.00       -182
         4      SYNEX      15000   22-12-30   23-07-07      16.40      12.00      -4.40     -26.83 -66,000.00        -44

In [11]:
os.chdir("C:\\users\\user\\onedrive\\a7\\Daily")
%pwd

'C:\\users\\user\\onedrive\\a7\\Daily'

In [12]:
data_path = "../data/"
file_name   = 'prices-change.csv'
input_file = data_path + file_name
df = pd.read_csv(input_file, sep=',', index_col=None)
df.sample(5)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
28,4,SINGER,6000,2022-12-30,2023-07-07,28.75,9.15,-19.60,-68.17,-117600.0,-182
19,3,JMT,6000,2022-12-30,2023-07-07,69.00,36.25,-32.75,-47.46,-196500.0,-131
29,4,SYNEX,15000,2022-12-30,2023-07-07,16.40,12.00,-4.40,-26.83,-66000.0,-44
22,4,AWC,9000,2022-12-30,2023-07-07,6.30,4.60,-1.70,-26.98,-15300.0,-46
17,3,BBL,400,2022-12-30,2023-07-07,148.00,156.00,8.00,5.41,3200.0,16

In [13]:
df.sample(5).sort_values(['spd'],ascending=False)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
24,4,ICHI,1500,2022-12-30,2023-07-07,11.30,13.60,2.30,20.35,3450.0,23
26,4,KCE,10000,2022-12-30,2023-07-07,46.50,36.50,-10.00,-21.51,-100000.0,-40
29,4,SYNEX,15000,2022-12-30,2023-07-07,16.40,12.00,-4.40,-26.83,-66000.0,-44
12,2,SENA,105000,2022-12-30,2023-07-07,3.94,2.98,-0.96,-24.37,-100800.0,-48
6,2,CPNREIT,60000,2022-12-30,2023-07-07,19.50,11.00,-8.50,-43.59,-510000.0,-85

In [14]:
df.sample(5).sort_values(['spd'],ascending=True)

,period,name,shares,date1,date2,price1,price2,change,%change,amount,spd
19,3,JMT,6000,2022-12-30,2023-07-07,69.00,36.25,-32.75,-47.46,-196500.0,-131
26,4,KCE,10000,2022-12-30,2023-07-07,46.50,36.50,-10.00,-21.51,-100000.0,-40
18,3,IVL,7200,2022-12-30,2023-07-07,40.75,33.25,-7.50,-18.40,-54000.0,-30
7,2,DIF,30000,2022-12-30,2023-07-07,13.20,10.90,-2.30,-17.42,-69000.0,-23
24,4,ICHI,1500,2022-12-30,2023-07-07,11.30,13.60,2.30,20.35,3450.0,23

In [15]:
period = df.groupby("period")
period.sum()

        shares  price1  price2  change  %change     amount  spd
period
1       250000   72.05   59.40  -12.65   -64.00  -391900.0 -113
2       453500  180.32  141.88  -38.44  -224.32 -1126150.0 -379
3        14200  599.75  547.50  -52.25   -66.30  -259300.0 -165
4        69400  259.25  191.30  -67.95  -200.12  -610510.0 -498

In [16]:
df.groupby('period').agg(
      ttl_shr = pd.NamedAgg('shares', 'sum'),
      avr_p1  = pd.NamedAgg('price1','mean'),
      avr_p2  = pd.NamedAgg('price2','mean'),  
      avr_chg = pd.NamedAgg('change','mean'),
      avr_spd = pd.NamedAgg('spd','mean'),
      ttl_amt = pd.NamedAgg('amount', 'sum')
   )

        ttl_shr      avr_p1      avr_p2    avr_chg    avr_spd    ttl_amt
period
1        250000   18.012500   14.850000  -3.162500 -28.250000  -391900.0
2        453500   13.870769   10.913846  -2.956923 -29.153846 -1126150.0
3         14200  149.937500  136.875000 -13.062500 -41.250000  -259300.0
4         69400   28.805556   21.255556  -7.550000 -55.333333  -610510.0

In [17]:
pl = df.amount.sum()
float_formatter.format(pl)

'à¸¿-2,387,860.00'

In [18]:
prev_pl = -2_379_485
diff = pl - prev_pl
float_formatter.format(diff)

'à¸¿-8,375.00'